Repository: seanpm2001/mt-training-data
Catalog: sd/sd_pontoon.tmx
Source language: en_us
Languages: sd

source: Speech is often the most natural way we communicate with each other and voice technologies are bringing that convenience to our computers and mobile devices. We want to empower developers to build amazing voice recognition applications like real-time translators and voice-enabled digital assistants. But right now most of the voice data required to build these kinds of apps is expensive and proprietary. We hope the Common Voice dataset will give developers what they need to innovate and make speech technology available in their own language. To make voice recognition even more universal, we're collecting voice samples in widely spoken languages as well as those with a smaller population of speakers often underserved by commercial speech recognition services. Publishing a diverse dataset of voices will empower developers, entrepreneurs, and entire speech communities to address this gap themselves.
sd: تقرير اڪثر قدرتي طريقو آهي جيڪو اسان هڪ ٻئي سان گفتگو ڪندا آهيون ۽ آواز ٽيڪنالاجيون اسان جي ڪمپيوٽرن ۽ موبائيل ڊوائيسز تي اها سهولت آڻيندي آهي. اسان ڊولپرز کي بااختيار بڻائڻ چاهيون ٿا ته جيئن شاندار آواز جي سڃاڻپ واريون ايپليڪيشنون تيار ڪن جيئن حقيقي وقت جا مترجم ۽ آواز سان فعال ڊجيٽل اسسٽنٽ. پر ھاڻي ھن قسم جي ائپس کي ٺاهڻ لاءِ گھربل گھڻا وائس ڊيٽا قيمتي ۽ ملڪيت آھي. اسان کي اميد آهي ته Common Voice dataset ڊولپرز کي اهو ڏيندو جيڪو انهن کي جدت آڻڻ ۽ اسپيچ ٽيڪنالاجي کي پنهنجي ٻولي ۾ دستياب ڪرڻ جي ضرورت آهي. آواز جي سڃاڻپ کي اڃا به وڌيڪ آفاقي بڻائڻ لاءِ، اسان وڏي پيماني تي ڳالهائيندڙ ٻولين ۾ آواز جا نمونا گڏ ڪري رهيا آهيون ۽ انهن سان گڏ ڳالهائيندڙن جي هڪ ننڍڙي آبادي وارا اڪثر ڪري ڪمرشل اسپيچ ريڪگنيشن سروسز کان محروم آهن. آوازن جي هڪ متنوع ڊيٽا سيٽ کي شايع ڪرڻ ڊولپرز، انٽرپرينيوئرز، ۽ سموري تقرير برادرين کي بااختيار بڻائيندو ته جيئن هن خال کي پاڻ پتوڙي سگهي.

source: Speech-to-text (STT)
sd: اسپيچ کان ٽيڪسٽ (STT)

source: Speech-to-text (STT) technologies convert voice data into text.
sd: اسپيچ-ٽو-ٽيڪسٽ (STT) ٽيڪنالاجيون آواز جي ڊيٽا کي متن ۾ تبديل ڪن ٿيون.

source: Spelling and Punctuation
sd: هجي ۽ اوقاف

source: Split into { $archiveCount } ZIP files containing
sd: زپ فائلن تي مشتمل { $archiveCount } ۾ ورهايو

source: Splits
sd: تقسيم

source: Start recording
sd: رڪارڊنگ شروع ڪريو

source: Start typing to describe your accent
sd: پنھنجي تلفظ کي بيان ڪرڻ لاءِ ٽائپنگ شروع ڪريو

source: Statistics
sd: شماريات

source: Stats
sd: انگ اکر

source: Status Page
sd: اسٽيٽس صفحو

source: Still have questions?
sd: اڃا سوال آهن؟

source: Streaks
sd: تارون

source: <strong>[Crackle]</strong> giant dinosaurs of <strong>[crackle]</strong> -riassic.
sd: <strong>[Crackle]</strong> ديو ڊائناسور جو <strong>[crackle]</strong> - riassic.

source: <strong>Do not reject clips where the speaker ‘has an accent’ that is different to your own</strong> - this is important for voice recognition to work better for everyone.
sd: <strong>ڪلپس کي رد نه ڪريو جتي اسپيڪر جو ’تلفظ آهي‘ جيڪو توهان جي پنهنجي لاءِ مختلف هجي</strong> - اهو ضروري آهي ته آواز جي سڃاڻپ لاءِ هر ڪنهن لاءِ بهتر ڪم ڪري.

source: <strong>Get creative!</strong> Your language community will be unique, and these are just a few ways to get started.
sd: <strong>تخليق حاصل ڪريو!</strong> توهان جي ٻولي ڪميونٽي منفرد هوندي، ۽ اهي شروع ڪرڻ جا صرف چند طريقا آهن.

source: <strong>[Sneeze]</strong> The giant dinosaurs of the <strong>[cough]</strong> Triassic.
sd: <strong>[نڇڻ]</strong> وڏي ڊائنوسار جو <strong>[کَس]</strong> ٽراسي.

source: Submission: { $batchId }
sd: جمع ڪرائڻ: { $batchId }

source: Submission Error
sd: جمع ڪرائڻ جي غلطي

source: Submit
sd: جمع ڪريو

source: Submit a report
sd: رپورٽ ڏيو

source: Submit clips
sd: ڪلپس جمع ڪريو

source: Submitted sentences. { $duplicates } sentences were rejected as duplicates.
sd: جمع ٿيل جملا. { $duplicates } جملا رد ڪيا ويا نقل طور.

source: Subscribe
sd: رڪنيت حاصل ڪريو

source: Success
sd: ڪاميابي

source: success checkmark
sd: ڪاميابي جي نشاني

source: Success, profile created!
sd: ڪاميابي، پروفائل ٺاهيو ويو!

source: Swahili
sd: سواهلي

source: Swedish
sd: سويڊني

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
sd: جملي کي منظور ڪرڻ لاءِ ساڄي طرف سوائپ ڪريو. ان کي رد ڪرڻ لاءِ کاٻي پاسي سوائپ ڪريو. ان کي ڇڏڻ لاءِ مٿي سوائپ ڪريو. <strong>پنهنجو جائزو جمع ڪرائڻ نه وساريو!</strong>

source: Syriac
sd: سيريائي

source: Tagalog
sd: تگلگ

source: Tahitian
sd: تائيٽي

source: Taiwanese (Minnan)
sd: تائيوان (منن) ٻولي

source: Tajik
sd: تاجڪ

source: Taking several attempts to read a word.
sd: هڪ لفظ پڙهڻ لاءِ ڪيتريون ئي ڪوششون ڪرڻ.

source: Tamazight
sd: تمازت

source: Tamil
sd: تامل

source: Tap
sd: ٽيپ ڪريو

source: Tatar
sd: تاتاري

source: Tatoeba is a large database of sentences, translations, and spoken audio for use in language learning. This download contains spoken English recorded by their community.
sd: Tatoeba جملن، ترجمن، ۽ ڳالهائيندڙ آڊيو جو هڪ وڏو ڊيٽابيس آهي جيڪو ٻولي سکڻ ۾ استعمال ڪرڻ لاء. هي ڊائون لوڊ انهن جي ڪميونٽي طرفان رڪارڊ ڪيل انگريزي ڳالهائيندڙ تي مشتمل آهي.

source: Tell us what you'd like to download:
sd: اسان کي ٻڌايو ته توهان ڇا ڊائون لوڊ ڪرڻ چاهيو ٿا:

source: Telugu
sd: تيلگو

source: Terms
sd: شرطون

source: Thai
sd: ٿائي

source: Thanks for confirming your account, now let's build your profile.
sd: توھان جي اڪائونٽ جي تصديق ڪرڻ لاءِ مھرباني، ھاڻي اچو توھان جو پروفائل ٺاھيون.

source: Thanks to contributions from over 259k people in over 50 languages, this data is being used to train speech-enabled applications to better respond to the human voice.
sd: 50 کان وڌيڪ ٻولين ۾ 259k کان وڌيڪ ماڻھن جي تعاون جي مھرباني، ھي ڊيٽا انساني آواز کي بھتر جواب ڏيڻ لاءِ تقرير-فعال ايپليڪيشنن کي تربيت ڏيڻ لاءِ استعمال ڪيو پيو وڃي.

source: Thank you for contributing your bulk submission!
sd: توهان جي مهرباني وڏي تعداد ۾ جمع ڪرائڻ ۾ مدد لاءِ!

source: Thank you for contributing your voice!
sd: توهان جي آواز ۾ حصو وٺڻ لاء توهان جي مهرباني!

source: Thank you for donating your voice clips!
sd: توهان جي آواز ڪلپس عطيو ڪرڻ لاء توهان جي مهرباني!

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
sd: رڪارڊنگ لاءِ توهان جي مهرباني!<lineBreak></lineBreak>هاڻي هيٺ ڏنل ڪلپس جو جائزو وٺو ۽ جمع ڪرايو.

source: Thank you for your interest in contributing to { $lang }. We work hard to get every language ready for launch and keep the teams updated via email. If you want to contribute, please provide your email below.
sd: { $lang } ۾ حصو وٺڻ ۾ توهان جي دلچسپي لاءِ مهرباني. اسان سخت محنت ڪريون ٿا ته هر ٻولي کي لانچ ۽ رکڻ لاءِ تيار ڪيو وڃي ٽيمن کي اي ميل ذريعي اپڊيٽ ڪيو ويو. جيڪڏھن توھان مدد ڪرڻ چاھيو ٿا، مھرباني ڪري ھيٺ پهنجي اي ميل ڏيو

source: Thank you for your voice information
sd: توهان جي آواز جي معلومات لاء توهان جي مهرباني

source: Thank you! You’ve sent a new language enquiry
sd: توهان جي مهرباني! توهان هڪ نئين ٻوليءَ جي انڪوائري موڪلي آهي

source: The best sentences are natural and conversational — they should be easy for someone to read. While phonetic diversity and different words in sentences is important, we are also trying to make recording sentences as engaging and fun for our volunteer community as possible.
sd: بهترين جملا قدرتي ۽ گفتگو وارا آهن - انهن کي پڙهڻ لاء آسان هجڻ گهرجي. جڏهن ته صوتياتي تنوع ۽ جملن ۾ مختلف لفظ اهم آهن، اسان پڻ ڪوشش ڪري رهيا آهيون ته رڪارڊنگ جملن کي اسان جي رضاڪار ڪميونٽي لاءِ ممڪن حد تائين دلچسپ ۽ مزيدار بڻائين.

source: The best sentences for building a useful speech recognition engine are colloquial, modern parlance. Some ideas to help you generate sentences are;
sd: هڪ مفيد تقرير جي سڃاڻپ واري انجڻ جي تعمير لاءِ بهترين جملا ڳالهائڻ وارا، جديد لفظ آهن. ڪجھ خيال توھان جي مدد ڪرڻ لاءِ آھن جملا پيدا ڪرڻ ۾؛

source: The best sources you can look for are podcasts, transcripts, movie scripts and anything that potential can contain everyday conversations.
sd: بهترين ذريعا جيڪي توهان ڳولي سگهو ٿا پوڊ ڪاسٽ، ٽرانسڪرپٽس، فلم اسڪرپٽ ۽ هر شيء جيڪا ممڪن طور تي روزمره جي گفتگو تي مشتمل هجي.

source: The bumblebee sped by.
sd: ٻٻر تيز رفتاري سان هليو ويو.

source: The Clip Graveyard consists of voice clips that didn't make it into the Common Voice dataset. Just like the dataset, the Clip Graveyard is available for download. We would like to thank the following people and organizations for their help with the project:
sd: ڪلپ قبرستان آواز جي ڪلپس تي مشتمل آهي جيڪي ان کي عام وائس ڊيٽا سيٽ ۾ نه ٺاهيا آهن. بس ڊيٽا سيٽ وانگر، قبرستان ڪلپ ڊائون لوڊ لاء دستياب آهي. اسان هيٺ ڏنل ماڻهن ۽ تنظيمن جو شڪريو ادا ڪرڻ چاهيون ٿا انهن جي هن منصوبي ۾ مدد لاءِ:

source: The clip has disrespectful or offensive language.
sd: ڪلپ ۾ بي عزتي يا جارحاڻي ٻولي آهي.

source: The Common Voice dataset complements Mozilla’s open source voice recognition engine Deep Speech. The first version of Deep Speech was released in November 2017 and has continued to evolve ever since. Together with the Common Voice dataset, we believe this open source voice recognition technology should be available to everybody. It’s our hope these technologies will enable developers to build a wave of innovative products and services.
sd: Common Voice dataset Mozilla جي اوپن سورس آواز جي سڃاڻپ واري انجڻ ڊيپ اسپيچ کي پورو ڪري ٿو. ڊيپ اسپيچ جو پهريون نسخو نومبر 2017 ۾ جاري ڪيو ويو ۽ ان وقت کان وٺي ترقي جاري آهي. ڪامن وائس ڊيٽا سيٽ سان گڏ، اسان سمجهون ٿا ته هي اوپن سورس آواز جي سڃاڻپ ٽيڪنالاجي هر ڪنهن لاءِ دستياب هجڻ گهرجي. اها اسان جي اميد آهي ته اهي ٽيڪنالاجيون ڊولپرز کي جديد پروڊڪٽس ۽ خدمتن جي هڪ لهر پيدا ڪرڻ جي قابل بڻائينديون.

source: The Common Voice Dataset contains hundreds of thousands of voice samples that help developers build voice recognition tools.
sd: Common Voice Dataset ۾ هزارين آوازن جا نمونا شامل آهن جيڪي ڊولپرز کي آواز جي سڃاڻپ جا اوزار ٺاهڻ ۾ مدد ڪن ٿا.

source: The Common Voice dataset is an open and publicly available resource that can be used to train a wide variety of speech-enabled applications. To protect the security of our contributors, we ask everyone who downloads the Common Voice dataset to respect contributors’ privacy. All voice clips in the dataset are scrubbed of personally identifying information. When you download the dataset, you agree to not attempt to determine the identity of any contributor. That means you cannot try to link information in the dataset to a contributor’s personal information. You may, however, use the dataset to train speech recognition, speaker recognition, or other applications, by, for instance, linking information in the dataset to other information already in the dataset.
sd: عام آواز ڊيٽا سيٽ هڪ کليل ۽ عوامي طور تي دستياب وسيلو آهي جيڪو استعمال ڪري سگهجي ٿو مختلف قسم جي تقرير-فعال ايپليڪيشنن کي تربيت ڏيڻ لاءِ. اسان جي مدد ڪندڙن جي سلامتي کي بچائڻ لاءِ، اسان هر ڪنهن کان پڇون ٿا جيڪو ڪامن وائس ڊيٽا سيٽ ڊائون لوڊ ڪري ٿو مدد ڪندڙن جي رازداري جو احترام ڪرڻ لاءِ. ڊيٽا سيٽ ۾ سڀئي وائس ڪلپس ذاتي طور تي سڃاڻپ ڪندڙ معلومات کي صاف ڪري رهيا آهن. جڏهن توهان ڊيٽا سيٽ ڊائون لوڊ ڪريو ٿا، توهان متفق آهيو ته ڪنهن به مدد ڪندڙ جي سڃاڻپ کي طئي ڪرڻ جي ڪوشش نه ڪريو. ان جو مطلب آهي ته توهان ڊيٽا سيٽ ۾ معلومات کي مدد ڏيندڙ جي ذاتي معلومات سان ڳنڍڻ جي ڪوشش نٿا ڪري سگهو. تنهن هوندي به، توهان استعمال ڪري سگهو ٿا ڊيٽا سيٽ کي تربيت ڏيڻ لاءِ تقرير جي سڃاڻپ، اسپيڪر جي سڃاڻپ، يا ٻيون ايپليڪيشنون، مثال طور، ڊيٽا سيٽ ۾ موجود معلومات کي ٻين معلومات سان ڳنڍڻ جو اڳ ۾ ئي ڊيٽا سيٽ ۾ موجود آهي.

source: The Common Voice dataset is available for download under the <licenseLink>CC0</licenseLink> license on <datasetLink>our Datasets page</datasetLink>. You can also download several other publicly available datasets from the same page.
sd: Common Voice dataset ڊائون لوڊ لاءِ موجود آهي <licenseLink>CC0</licenseLink> لائسنس هيٺ <datasetLink>اسان جي Datasets صفحي</datasetLink> تي. توھان پڻ ڊائون لوڊ ڪري سگھو ٿا ٻيا ڪيترائي عوامي طور تي دستياب ڊيٽا سيٽ ساڳئي صفحي تان.

source: The Common Voice Sentence Collector has collected { $sentenceCount } sentences in { $languageCount } languages!
sd: عام آواز جي جملي ڪليڪٽر گڏ ڪيو آهي { $sentenceCount } جملا { $languageCount } ٻولين ۾!

source: The community is the beating heart of Common Voice - they come from all over the world, and are language activists and scientists and artists. You can learn more about how to get involved on our <about>About</about> page and in our <community>Community playbook</community>. If you're interested in deeper organisational partnership, <emailFragment>get in touch.</emailFragment>
sd: ڪميونٽي عام آواز جي ڌڙڪندڙ دل آهي - اهي سڄي دنيا مان اچن ٿا، ۽ ٻولي جي سرگرم ڪارڪن ۽ سائنسدان ۽ فنڪار آهن. توهان اسان جي <about>About</about> صفحي تي ۽ اسان جي <community>Community playbook</community> ۾ شامل ٿيڻ بابت وڌيڪ سکو سگهو ٿا. جيڪڏھن توھان چاھيو ٿا بھترين تنظيمي شراڪت ۾، <emailFragment>رابطي ۾ رھو.</emailFragment>

source: The count of voice recording hours that have been validated by 2 out of 3 users with a vote of “Yes”. These mark progress toward the overall project 10k hours goal.
sd: آواز جي رڪارڊنگ ڪلاڪن جي ڳڻپ جنهن جي تصديق ڪئي وئي آهي 2 مان 3 صارفين جي ووٽ سان ”ها“. اهي نشان ترقي جي مجموعي منصوبي جي طرف 10k ڪلاڪ مقصد.

source: The count of voice recording hours we have collected so far.
sd: آواز جي رڪارڊنگ ڪلاڪن جو ڳڻپ اسان هينئر تائين گڏ ڪيو آهي.

source: The giant dino [cough] the Triassic.
sd: وشال ڊنو [کنگ] ٽراسڪ.

source: The giant dinosaur of the Triassic.
sd: ٽرياسڪ جو وڏو ڊائنوسار.

source: The giant dinosaurs of the Triassi-.
sd: ٽرياسڪ جا وڏا ڊائناسور.

source: The giant dinosaurs of the Triassic.
sd: ٽرياسڪ جا وڏا ڊائناسور.

source: The giant dinosaurs of the Triassic. [read by one voice]
sd: ٽرياسڪ جي وڏي ڊائناسور. [هڪ آواز سان پڙهو]

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
sd: ٽرياسڪ جي وڏي ڊائناسور. <strong>[هڪ آواز سان پڙهو]</strong>

source: The giant dinosaurs of the Triassic. Yes.
sd: ٽرياسڪ جا وڏا ڊائناسور. جي ها

source: The giant dino <strong>[cough]</strong> the Triassic.
sd: ديو ڊنو<strong>[کنگھ]</strong>ٽرياسڪ.

source: The goal of the Common Voice dataset is to enable anyone in the world to build speech recognition, speaker recognition, or any other type of application that requires voice data. A voice assistant is just one of many types of applications you could use the dataset to build.
sd: ڪامن وائس ڊيٽا سيٽ جو مقصد دنيا ۾ هر ڪنهن کي تقرير جي سڃاڻپ، اسپيڪر جي سڃاڻپ، يا ڪنهن ٻئي قسم جي ايپليڪيشن ٺاهڻ جي قابل بڻائڻ آهي جنهن کي آواز ڊيٽا جي ضرورت آهي. هڪ وائس اسسٽنٽ ڪيترن ئي قسمن جي ايپليڪيشنن مان صرف هڪ آهي جنهن کي توهان استعمال ڪري سگهو ٿا ڊيٽا سيٽ ٺاهڻ لاءِ.

source: The multi-language version of the Common Voice dataset is currently undergoing community supported bundling and cleaning. If you would like to help us bring Common Voice to new languages, go check out the <sentenceCollectorLink>Sentence Collection Tool</sentenceCollectorLink> for adding new sentences to the dataset, and Mozilla <pontoonLink>Pontoon</pontoonLink> for translating the website itself. New languages are added to Common Voice for voice contribution when 5000 approved sentences have been collected.
sd: ڪامن وائس ڊيٽا سيٽ جو گھڻن ٻولين وارو نسخو ھن وقت ڪميونٽي جي مدد سان بنڊلنگ ۽ صفائي ڪري رھيو آھي. جيڪڏھن توھان اسان جي مدد ڪرڻ چاھيو ٿا Common Voice کي نئين ٻولين ۾ آڻڻ لاءِ، وڃو چيڪ ڪريو <sentenceCollectorLink>Sentence Collection Tool</sentenceCollectorLink> ڊيٽا سيٽ ۾ نوان جملا شامل ڪرڻ لاءِ، ۽ ويب سائيٽ جي ترجمي لاءِ Mozilla <pontoonLink>Pontoon</pontoonLink> پاڻ. 5000 منظور ٿيل جملا گڏ ڪيا ويا ته آواز جي تعاون لاءِ گڏيل آواز ۾ نيون ٻوليون شامل ڪيون ويون.

source: The number of recordings and which languages you contribute to will be public.
sd: رڪارڊنگ جو تعداد ۽ جن ٻولين ۾ توھان حصو وٺندا آھيو اھو عوامي ھوندو.

source: The process by which a contributor’s profile information is obscured from their donated voice clips when packaged for download as a part of the dataset.
sd: اهو عمل جنهن جي ذريعي مدد ڪندڙ جي پروفائل جي معلومات انهن جي عطيو ڪيل وائس ڪلپس مان لڪايو وڃي ٿو جڏهن ڊيٽا سيٽ جي حصي طور ڊائون لوڊ لاءِ پيڪيج ڪيو وڃي.

source: There are a lot of public organizations that might want to collaborate and already have a lot of texts they can donate as public domain. Reach out to local universities, Governments and open source organizations to talk about the project and ask for their help.
sd: اتي ڪيتريون ئي عوامي تنظيمون آھن جيڪي شايد تعاون ڪرڻ چاھين ٿيون ۽ اڳ ۾ ئي ڪيترائي متن آھن جيڪي اھي عطيو ڪري سگھن ٿيون عوامي ڊومين جي طور تي. پروجيڪٽ بابت ڳالهائڻ لاءِ مقامي يونيورسٽين، حڪومتن ۽ اوپن سورس تنظيمن تائين پهچ ۽ انهن جي مدد لاءِ پڇو.

source: There are currently no sentences to review in this language.
sd: في الحال ھن ٻوليءَ ۾ نظرثاني ڪرڻ لاءِ ڪي به جملا نه آھن.

source: There are lots of ways to think about language. For the purposes of speech recognition models, Common Voice suggests focussing on ‘mutual intelligibility’, or ‘can speakers of this language mostly understand one another if they try to?’
sd: ٻولي بابت سوچڻ جا ڪيترائي طريقا آهن. اسپيچ ريڪگنيشن ماڊلز جي مقصدن لاءِ، Common Voice مشورو ڏئي ٿو ته ’باہمي سمجهه‘ تي ڌيان ڏيو، يا ’ڇا هن ٻولي جا ڳالهائيندڙ گهڻو ڪري هڪ ٻئي کي سمجهي سگهن ٿا جيڪڏهن اهي ڪوشش ڪن؟

source: The recording was too long.
sd: رڪارڊنگ تمام ڊگھي ھئي.

source: The recording was too quiet.
sd: رڪارڊنگ ڏاڍي خاموش هئي.

source: The recording was too short.
sd: رڪارڊنگ تمام مختصر هئي.

source: There should ideally be no digits in the source text because they can cause problems when read aloud. The way a number is read depends on context and might introduce confusion in the dataset. For example, the number “2409” could be accurately read as both “twenty-four zero nine” and “two thousand four hundred nine”.
sd: ماخذ متن ۾ مثالي طور تي ڪو به انگ نه هجڻ گهرجي ڇو ته اهي مسئلا پيدا ڪري سگهن ٿا جڏهن بلند آواز سان پڙهو. هڪ انگ پڙهڻ جو طريقو حوالن تي منحصر آهي ۽ شايد ڊيٽا سيٽ ۾ مونجهارو متعارف ڪرايو. مثال طور، نمبر "2409" صحيح طور تي پڙهي سگهجي ٿو ٻنهي "چوويس صفر نو" ۽ "ٻه هزار چار سئو نو".

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
sd: پڙهندڙن جي وچ ۾ مقدار ۾ قدرتي تبديليون هونديون. رد ڪريو صرف ان صورت ۾ جيڪڏهن مقدار تمام گهڻو آهي ته رڪارڊنگ ختم ٿي وڃي، يا (وڌيڪ عام طور تي) جيڪڏهن اهو تمام گهٽ آهي ته توهان اهو ٻڌي نٿا سگهو ته لکيل متن جي حوالي کان سواء ڇا چيو پيو وڃي.

source: The route was unclear.
sd: رستو واضح نه هو.

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
sd: اهي ٻوليون هن وقت ڪميونٽي جي ترقي هيٺ آهن. <localizationGlossaryLink>ويب سائيٽ لوڪلائيزيشن</localizationGlossaryLink> ۽ <sentenceCollectionGlossaryLink>جملن جو مجموعو</sentenceCollectionGlossaryLink> شروع ڪرڻ جي ضرورت آهي.

source: The selected file is too large
sd: منتخب ٿيل فائل تمام وڏي آھي

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
sd: جملا ڪليڪٽر بنيادي عام آواز پليٽ فارم ڏانهن منتقل ٿي رهيو آهي. توھان ھاڻي ڪري سگھو ٿا <writeURL>لکيو</writeURL> ھڪڙو جملو يا <reviewURL>review</reviewURL> ھڪڙو جملو جمع ڪرايا وڃن عام آواز تي.

source: The Sentence Collector is part of <commonVoiceLink>Common Voice</commonVoiceLink>. It allows contributors to collect and validate sentences created by the community. You can use this tool also to import and clean-up small-to-medium-sized public domain corpus you have found or collected. All sentences need to be Public Domain. Approved sentences are exported every week to the Common Voice repository and are released on the Common Voice website on every new deployment.
sd: جملا گڏ ڪندڙ <commonVoiceLink>Common Voice</commonVoiceLink> جو حصو آهي. اهو حصو وٺندڙن کي ڪميونٽي پاران ٺاهيل جملن کي گڏ ڪرڻ ۽ تصديق ڪرڻ جي اجازت ڏئي ٿو. توھان ھي آوزار پڻ استعمال ڪري سگھو ٿا درآمد ڪرڻ ۽ صاف ڪرڻ لاءِ ننڍي-کان-وچولي-سائيز عوامي ڊومين ڪورپس جيڪو توھان مليو يا گڏ ڪيو آھي. سڀئي جملا عوامي ڊومين جا هجڻ گهرجن. منظور ٿيل جملا ھر ھفتي ڪامن وائس ريپوزٽري ڏانھن برآمد ڪيا ويندا آھن ۽ عام آواز جي ويب سائيٽ تي ھر نئين ڊيپلائيمينٽ تي جاري ڪيا ويندا آھن.

source: The sentence has a grammatical or spelling error.
sd: جملي ۾ گرامر يا اسپيلنگ جي غلطي آهي.

source: The sentence has disrespectful or offensive language.
sd: جملي ۾ بي عزتي يا جارحاڻي ٻولي آهي.

source: The sentence must be grammatically correct.
sd: جملو گرامر جي لحاظ کان درست هجڻ گهرجي.

source: The sentence must be speakable.
sd: جملو ڳالهائڻ جوڳو هئڻ گهرجي.

source: The sentence must be spelled correctly.
sd: جملي کي صحيح طور تي لکڻ گهرجي.

source: The sentence should have fewer than 15 words.
sd: جملي ۾ 15 لفظن کان گھٽ هجڻ گھرجن.

source: The site is ready to be launched when it reaches 75% completion.
sd: سائيٽ شروع ٿيڻ لاءِ تيار آهي جڏهن اها 75 سيڪڙو مڪمل ٿي وڃي.

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
sd: سائيٽ کي جلد کان جلد بيڪ اپ ڪيو ويندو. تازه ترين معلومات لاءِ، مھرباني ڪري شامل ٿيو <matrixLink>Matrix ڪميونٽي چيٽ</matrixLink> يا دورو ڪريو <githubLink>GitHub</githubLink> يا <discourseLink>اسان جي ڊسڪورس فورمز</discourseLink> سائيٽ جي تجربي جي مسئلن کي پيش ڪرڻ ۽ مانيٽر ڪرڻ لاءِ.

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
sd: TED-LIUM corpus آڊيو ڳالهين مان ٺاهيو ويو ۽ TED ويب سائيٽ تي موجود انهن جي ٽرانسڪرپشن.

source: The website text is translated into that language.
sd: ويب سائيٽ جو متن انهي ٻولي ۾ ترجمو ڪيو ويو آهي.

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
sd: اها معلومات مهيا ڪرڻ لاءِ اختياري آهي - توهان کي صرف ان کي شامل ڪرڻ گهرجي جيڪڏهن توهان آرام سان محسوس ڪيو. جڏهن اسان ڊيٽا سيٽ کي جاري ڪريون ٿا، اسان سڀ ذاتي معلومات تخلص ڪريون ٿا، ۽ پڪ ڪريو ته معلومات جهڙوڪ توهان جو نالو ۽ اي ميل ڊيموگرافڪ معلومات جهڙوڪ عمر يا جنس سان ڳنڍيل ناهي.

source: This is approximately the number of hours required to train a production speech-to-text system.
sd: اهو تقريباً ڪلاڪن جو تعداد آهي جيڪو هڪ پيداوار واري تقرير کان ٽيڪسٽ سسٽم کي تربيت ڏيڻ لاءِ گهربل آهي.

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
sd: هي هڪ استعمال ڪيس هلائيندڙ حصو آهي جنهن ۾ ڊيٽا شامل آهي طاقت ڳالهائيندڙ انگن اکرن جي سڃاڻپ ۽ ها / نه ڳولڻ.

source: This is how you cite yourself if you wrote the content yourself.
sd: جيڪڏهن توهان مواد پاڻ لکيو آهي ته توهان پنهنجو پاڻ کي ڪيئن بيان ڪيو آهي.

source: This is our process for translating and adapting our content for many locales (languages).
sd: اسان جي مواد کي ڪيترن ئي ماڳن (ٻولين) ۾ ترجمو ڪرڻ ۽ ان کي ترتيب ڏيڻ لاءِ اسان جو اهو عمل آهي.
